---
kind: other
id: Methods.T:Autodesk.Revit.DB.Revolution
source: html/f438f13d-a3b2-4f98-c779-f4066383c589.htm
---
# Revolution Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.